[Killed] BlockStatement
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:1:59
-const calculaTaxaDesconto = (tipoCliente, valorCompra) => {
-  let taxa = 0
-  if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
-  else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
-  else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
-
-  return taxa
-}
+const calculaTaxaDesconto = (tipoCliente, valorCompra) => {}
 
 module.exports = calculaTaxaDesconto
killedBy: ouro discount is 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] LogicalOperator
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:3:7
 const calculaTaxaDesconto = (tipoCliente, valorCompra) => {
   let taxa = 0
-  if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
+  if (valorCompra >= 500 && tipoCliente === 'ouro') return 15
   else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
   else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
killedBy: ouro discount is 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 10

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:3:29
 const calculaTaxaDesconto = (tipoCliente, valorCompra) => {
   let taxa = 0
-  if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
+  if (valorCompra >= 500 || false) return 15
   else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
   else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
killedBy: ouro discount is 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 10

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:4:12
 const calculaTaxaDesconto = (tipoCliente, valorCompra) => {
   let taxa = 0
   if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
-  else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
+  else if (true) taxa = 10
   else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
 
killedBy: bronze min discount is 5%, purchases above R$ 400.00 are 10% and above R$ 500.00 are 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:4:12
 const calculaTaxaDesconto = (tipoCliente, valorCompra) => {
   let taxa = 0
   if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
-  else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
+  else if (false) taxa = 10
   else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
 
killedBy: prata min discount is 10% and purchases above R$ 500.00 are 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] EqualityOperator
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:5:12
   let taxa = 0
   if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
   else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
-  else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
+  else if (valorCompra > 200 || tipoCliente === 'bronze') taxa = 5
 
   return taxa
killedBy: R$ 200.00 limit test case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:5:34
   let taxa = 0
   if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
   else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
-  else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
+  else if (valorCompra >= 200 || tipoCliente !== 'bronze') taxa = 5
 
   return taxa
killedBy: bronze min discount is 5%, purchases above R$ 400.00 are 10% and above R$ 500.00 are 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
