[Killed] ArrowFunction
Teste de Software/Teste de Mutação/src/checkDigitLetter.js:1:18
-const isLetter = (char) => /^([a-z]|[A-Z])$/.test(char)
+const isLetter = () => undefined
 const isDigit = (char) => /^([0-9])$/.test(char)
 
killedBy: id can be composed of characters and digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
Teste de Software/Teste de Mutação/src/checkDigitLetter.js:1:28
-const isLetter = (char) => /^([a-z]|[A-Z])$/.test(char)
+const isLetter = (char) => /([a-z]|[A-Z])$/.test(char)
 const isDigit = (char) => /^([0-9])$/.test(char)
 

[Killed] ArrowFunction
Teste de Software/Teste de Mutação/src/checkDigitLetter.js:2:17
 const isLetter = (char) => /^([a-z]|[A-Z])$/.test(char)
-const isDigit = (char) => /^([0-9])$/.test(char)
+const isDigit = () => undefined
 
 module.exports = {
killedBy: id can be composed of characters and digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
Teste de Software/Teste de Mutação/src/checkDigitLetter.js:2:27
 const isLetter = (char) => /^([a-z]|[A-Z])$/.test(char)
-const isDigit = (char) => /^([0-9])$/.test(char)
+const isDigit = (char) => /([0-9])$/.test(char)
 
 module.exports = {
