[Killed] BlockStatement
Teste de Software/Teste de Mutação/src/validarIdentificador.js:3:38
 const { isDigit, isLetter } = require('./checkDigitLetter')
 
-const validarIdentificador = (id) => {
-  if (id === null) return false
-  if (id.length < 1 || id.length > 6) return false
-  if (!isLetter(id.charAt(0))) return false
-
-  for (let i = 1; i < id.length; i++) {
-    const char = id.charAt(i)
-    if (!isLetter(char) && !isDigit(char)) return false
-  }
-
-  return true
-}
+const validarIdentificador = (id) => {}
 
 module.exports = validarIdentificador
killedBy: doesn't accept null values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/validarIdentificador.js:4:7
 const { isDigit, isLetter } = require('./checkDigitLetter')
 
 const validarIdentificador = (id) => {
-  if (id === null) return false
+  if (false) return false
   if (id.length < 1 || id.length > 6) return false
   if (!isLetter(id.charAt(0))) return false
killedBy: doesn't accept null values
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
Teste de Software/Teste de Mutação/src/validarIdentificador.js:4:7
 const { isDigit, isLetter } = require('./checkDigitLetter')
 
 const validarIdentificador = (id) => {
-  if (id === null) return false
+  if (id !== null) return false
   if (id.length < 1 || id.length > 6) return false
   if (!isLetter(id.charAt(0))) return false
killedBy: doesn't accept null values
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/validarIdentificador.js:5:24
 
 const validarIdentificador = (id) => {
   if (id === null) return false
-  if (id.length < 1 || id.length > 6) return false
+  if (id.length < 1 || false) return false
   if (!isLetter(id.charAt(0))) return false
 
killedBy: length has to be between 1 and 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
Teste de Software/Teste de Mutação/src/validarIdentificador.js:5:7
 
 const validarIdentificador = (id) => {
   if (id === null) return false
-  if (id.length < 1 || id.length > 6) return false
+  if (id.length < 1 && id.length > 6) return false
   if (!isLetter(id.charAt(0))) return false
 
killedBy: length has to be between 1 and 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
Teste de Software/Teste de Mutação/src/validarIdentificador.js:6:39
 const validarIdentificador = (id) => {
   if (id === null) return false
   if (id.length < 1 || id.length > 6) return false
-  if (!isLetter(id.charAt(0))) return false
+  if (!isLetter(id.charAt(0))) return true
 
   for (let i = 1; i < id.length; i++) {
killedBy: id can't start with digit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/validarIdentificador.js:6:7
 const validarIdentificador = (id) => {
   if (id === null) return false
   if (id.length < 1 || id.length > 6) return false
-  if (!isLetter(id.charAt(0))) return false
+  if (true) return false
 
   for (let i = 1; i < id.length; i++) {
killedBy: id can be composed of characters and digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
Teste de Software/Teste de Mutação/src/validarIdentificador.js:8:39
   if (id.length < 1 || id.length > 6) return false
   if (!isLetter(id.charAt(0))) return false
 
-  for (let i = 1; i < id.length; i++) {
-    const char = id.charAt(i)
-    if (!isLetter(char) && !isDigit(char)) return false
-  }
+  for (let i = 1; i < id.length; i++) {}
 
   return true
killedBy: id can't contain special characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UpdateOperator
Teste de Software/Teste de Mutação/src/validarIdentificador.js:8:34
   if (id.length < 1 || id.length > 6) return false
   if (!isLetter(id.charAt(0))) return false
 
-  for (let i = 1; i < id.length; i++) {
+  for (let i = 1; i < id.length; i--) {
     const char = id.charAt(i)
     if (!isLetter(char) && !isDigit(char)) return false
killedBy: id can be composed of characters and digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/validarIdentificador.js:10:9
 
   for (let i = 1; i < id.length; i++) {
     const char = id.charAt(i)
-    if (!isLetter(char) && !isDigit(char)) return false
+    if (false) return false
   }
 
killedBy: id can't contain special characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] LogicalOperator
Teste de Software/Teste de Mutação/src/validarIdentificador.js:10:9
 
   for (let i = 1; i < id.length; i++) {
     const char = id.charAt(i)
-    if (!isLetter(char) && !isDigit(char)) return false
+    if (!isLetter(char) || !isDigit(char)) return false
   }
 
killedBy: id can be composed of characters and digits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
