[Killed] ConditionalExpression
Teste de Software/Teste de Mutação/src/calculaTaxaDesconto.js:5:34
   let taxa = 0
   if (valorCompra >= 500 || tipoCliente === 'ouro') return 15
   else if (tipoCliente === 'prata' || valorCompra >= 400) taxa = 10
-  else if (valorCompra >= 200 || tipoCliente === 'bronze') taxa = 5
+  else if (valorCompra >= 200 || false) taxa = 5
 
   return taxa
killedBy: bronze min discount is 5%, purchases above R$ 400.00 are 10% and above R$ 500.00 are 15%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
